# PandasChapter_06

In [40]:
import pandas as pd
import numpy as np

In [41]:
def sqr_number(number):
    """ This will return the square of given number"""
    return number ** 2

In [42]:
df = pd.DataFrame(
    {
    'a': [10, 20 , 30],
    'b': [20 , 30, 40],
    }
)
df

    a   b
0  10  20
1  20  30
2  30  40

In [43]:
df['a'] ** 2

0    100
1    400
2    900
Name: a, dtype: int64

In [44]:
df['a'].apply(sqr_number)

0    100
1    400
2    900
Name: a, dtype: int64

In [45]:
def print_me(x):
    print(x)

In [46]:
# pick the column and apply function on it 
# df.apply is default column by column 
df.apply(print_me, axis=0)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [47]:
# above 2 None because we dont print_me function does not resturn any thing

In [48]:
# pick the row and apply function on it 
# df.apply we can tell to work row by row. 

df.apply(print_me, axis=1)

a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64

0    None
1    None
2    None
dtype: object

In [49]:
# above 3 None because we dont print_me function does not resturn any thing

In [50]:
def avg_three_numbers(number_a, number_b, number_c):
    return (number_a + number_b + number_c) /3

In [51]:
def avg_three_numbers_rewritten(columnOfDataFrame):
    number_a = columnOfDataFrame[0]
    number_b = columnOfDataFrame[1]
    number_c = columnOfDataFrame[2]
    return (number_a + number_b + number_c) /3

In [52]:
# this give error because it pick one column on dataframe pass as a arument where as function expect 3 argument . Hence error 
# is missing 2 values.
df.apply(avg_three_numbers)

TypeError: ("avg_three_numbers() missing 2 required positional arguments: 'number_b' and 'number_c'", 'occurred at index a')

In [53]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [54]:
df.apply(avg_three_numbers_rewritten)

a    20.0
b    30.0
dtype: float64

# titanic Dataset

In [79]:
import seaborn as sns

titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [56]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
survived       891 non-null int64
pclass         891 non-null int64
sex            891 non-null object
age            714 non-null float64
sibsp          891 non-null int64
parch          891 non-null int64
fare           891 non-null float64
embarked       889 non-null object
class          891 non-null category
who            891 non-null object
adult_male     891 non-null bool
deck           203 non-null category
embark_town    889 non-null object
alive          891 non-null object
alone          891 non-null bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [60]:
def count_missing(vec):
    null_vec = pd.isnull(vec)
    # Above Statement will create a array of Bool which will Hold True or False.
    # True's are 1 and False are 0
    null_count = np.sum(null_vec)
    # this statement will calculate sum like 1+0+1+1+0+0 , so it will give me how many True are there . i.e , How many NaN 
    # are there
    return(null_count)

In [61]:
def prop_missing(vec):
    # this is proportion missing i.e number of NaN / Total number of elements in an array.
    num = count_missing(vec)
    dem = vec.size
    return num / dem

In [62]:
def prop_complete(vec):
    # this is proportion of complete i.e 1 - prportion of missing
    return 1 - prop_missing(vec)

In [63]:
titanic.apply(count_missing)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [70]:
titanic[titanic['embark_town'].isnull()]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
61,1,1,female,38.0,0,0,80.0,NaN,First,woman,False,B,NaN,yes,True
829,1,1,female,62.0,0,0,80.0,NaN,First,woman,False,B,NaN,yes,True

In [71]:
titanic.loc[pd.isnull(titanic['embark_town']), :]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
61,1,1,female,38.0,0,0,80.0,NaN,First,woman,False,B,NaN,yes,True
829,1,1,female,62.0,0,0,80.0,NaN,First,woman,False,B,NaN,yes,True

In [64]:
titanic.apply(prop_missing)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [65]:
titanic.apply(prop_complete)

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

In [73]:
#How many missing value in each row.
titanic.apply(count_missing, axis=1)

0      1
1      0
2      1
3      0
4      1
5      2
6      0
7      1
8      1
9      1
10     0
11     0
12     1
13     1
14     1
15     1
16     1
17     2
18     1
19     2
20     1
21     0
22     1
23     0
24     1
25     1
26     2
27     0
28     2
29     2
      ..
861    1
862    0
863    2
864    1
865    1
866    1
867    0
868    2
869    1
870    1
871    0
872    0
873    1
874    1
875    1
876    1
877    1
878    2
879    0
880    1
881    1
882    1
883    1
884    1
885    1
886    1
887    0
888    2
889    0
890    1
Length: 891, dtype: int64

In [74]:
titanic.apply(count_missing, axis=1).value_counts()

1    549
0    182
2    160
dtype: int64

In [75]:
# 549 rows have 1 missing value
# 182 rows have 0 missing value
# 160 rows have 2 missing value.

In [76]:
def clean_1_colum(single_column):
    return single_column[1:]

In [77]:
clean_1_colum('d42')

'42'

In [83]:
titanic.groupby(['sex'])['age'].describe()

        count       mean        std   min   25%   50%   75%   max
sex
female  261.0  27.915709  14.110146  0.75  18.0  27.0  37.0  63.0
male    453.0  30.726645  14.678201  0.42  21.0  29.0  39.0  80.0

In [84]:
titanic.groupby(['sex'])['age'].agg(np.mean)

sex
female    27.915709
male      30.726645
Name: age, dtype: float64

In [85]:
titanic.groupby(['sex'])['age'].agg(np.std)

sex
female    14.110146
male      14.678201
Name: age, dtype: float64

In [88]:
# Writing your own function to apply on panda groupby aggrigate
def my_mean(values):
    n = len(values)
    s = np.sum(values)
    return s / n

In [89]:
titanic.groupby(['sex'])['age'].agg(my_mean)

sex
female    23.203822
male      24.123345
Name: age, dtype: float64

In [90]:
titanic.groupby(['sex'])['age'].agg( [np.count_nonzero, np.mean, np.std] )

        count_nonzero       mean        std
sex
female          314.0  27.915709  14.110146
male            577.0  30.726645  14.678201

In [99]:
# Old way depreciating , use the next line new way
titanic.groupby(['sex'])['age'].agg( {'ncount': np.count_nonzero, 'mean_value':np.mean, 'std_value':np.std} )

D:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: using a dict on a Series for aggregation
is deprecated and will be removed in a future version

        ncount  mean_value  std_value
sex
female   314.0   27.915709  14.110146
male     577.0   30.726645  14.678201

In [100]:
titanic.groupby(['sex'])['age'].agg( [np.count_nonzero, np.mean, np.std] )\
.rename(columns = {'count_nonzero': 'count','mean': 'avg', 'std': 'std_dev'}).reset_index()

      sex  count        avg    std_dev
0  female  314.0  27.915709  14.110146
1    male  577.0  30.726645  14.678201